/*Задача: Написать программу которая выводит случайное число из отрезка (чисел) [10, 99] и показывает наибольшую цифру числа .

например:
8→ 8

12→2

85→8
*/


/*Console.Clear();

void [] Sort(int[] numbers, bool reverse = false)
{
    Console.WriteLine($"{name}");
}
  int[] mass1 = {1, 2, 5, 7, 9, 5,};
  Sort(mass1, reverse : true);  

  int[] array = new int [4];

  */

  int x = 29 ; 

  if (x >= 10 & x <= 30)
  {
    Console.WriteLine("+++");
  }
  else
  {
    Console.WriteLine("---");
  }
  